//=====================================================
//
// ブロックの処理[block.cpp]
// Author:石原颯馬
//
//=====================================================
#include "block.h"

//=====================================
//コンストラクタ
//=====================================
CBlock::CBlock()
{
}

//=====================================
//デストラクタ
//=====================================
CBlock::~CBlock()
{
}

//=====================================
//初期化
//=====================================
HRESULT CBlock::Init(void)
{
	return CObject2D::Init();	//親処理
}

//=====================================
//終了
//=====================================
void CBlock::Uninit(void)
{
	CObject2D::Uninit();		//親処理
}

//=====================================
//更新
//=====================================
void CBlock::Update(void)
{
	CObject2D::Update();		//親処理
}

//=====================================
//描画
//=====================================
void CBlock::Draw(void)
{
	CObject2D::Draw();			//親処理
}

//=====================================
//生成
//=====================================
CBlock* CBlock::Create(int nPriority)
{
	CBlock* pBlock = nullptr;

	//一応チェック
	if (pBlock == nullptr)
	{//生成
		pBlock = new CBlock;	//生成
		pBlock->Init();			//初期化

		return pBlock;
	}
	return nullptr;	//たぶん起きないと思うけど
}
